#Задание:

Найти результат умножения двух длинных чисел.

#Вводные данные:

В первой строке содержится одно число длиной не более 255 знаков. Во второй строке содержится операция (* - умножение). Третья строка содержит второе число, также длиной не более 255 знаков.

#Исходные данные:

Вывести единственное число – результат выполнения заданой операции над этими двумя числами.

```csharp
using System;

class Program
{
    static void Main()
    {
        string number1 = Console.ReadLine();
        char operation = Console.ReadLine()[0];
        string number2 = Console.ReadLine();

        int[] num1 = ConvertToDigitsArray(number1);
        int[] num2 = ConvertToDigitsArray(number2);

        int[] result = MultiplyNumbers(num1, num2);

        Console.WriteLine(ConvertToString(result));
    }

    static int[] ConvertToDigitsArray(string number)
    {
        int[] digits = new int[number.Length];

        for (int i = 0; i < number.Length; i++)
        {
            digits[i] = int.Parse(number[i].ToString());
        }

        return digits;
    }

    static int[] MultiplyNumbers(int[] num1, int[] num2)
    {
        int m = num1.Length;
        int n = num2.Length;
        int[] result = new int[m + n];

        for (int i = m - 1; i >= 0; i--)
        {
            for (int j = n - 1; j >= 0; j--)
            {
                int product = num1[i] * num2[j];
                int sum = product + result[i + j + 1];

                result[i + j] += sum / 10;
                result[i + j + 1] = sum % 10;
            }
        }

        return result;
    }

    static string ConvertToString(int[] number)
    {
        string result = "";

        foreach (int digit in number)
        {
            result += digit.ToString();
        }

        return result.TrimStart('0');
    }
}
using System;

class Program
{
    static void Main()
    {
        // Считываем первое число
        string number1 = Console.ReadLine();

        // Считываем операцию
        char operation = Console.ReadLine()[0];

        // Считываем второе число
        string number2 = Console.ReadLine();

        // Преобразуем числа в массивы цифр
        int[] num1 = ConvertToDigitsArray(number1);
        int[] num2 = ConvertToDigitsArray(number2);

        // Умножаем числа и получаем результат в виде массива цифр
        int[] result = MultiplyNumbers(num1, num2);

        // Выводим результат
        Console.WriteLine(ConvertToString(result));
    }

    // Метод для преобразования строки с числом в массив цифр
    static int[] ConvertToDigitsArray(string number)
    {
        // Создаем новый массив для хранения цифр
        int[] digits = new int[number.Length];

        // Проходимся по каждому символу в строке
        for (int i = 0; i < number.Length; i++)
        {
            // Преобразуем символ в целое число и сохраняем в массив
            digits[i] = int.Parse(number[i].ToString());
        }

        // Возвращаем массив цифр
        return digits;
    }

    // Метод для умножения двух чисел, представленных массивами цифр
    static int[] MultiplyNumbers(int[] num1, int[] num2)
    {
        // Получаем длины массивов
        int m = num1.Length;
        int n = num2.Length;

        // Создаем массив для хранения результата умножения
        int[] result = new int[m + n];

        // Выполняем умножение
        for (int i = m - 1; i >= 0; i--)
        {
            for (int j = n - 1; j >= 0; j--)
            {
                // Вычисляем произведение цифр и сумму с текущим значением результата
                int product = num1[i] * num2[j];
                int sum = product + result[i + j + 1];

                // Обновляем значения в массиве результата с учетом переносов
                result[i + j] += sum / 10;
                result[i + j + 1] = sum % 10;
            }
        }

        // Возвращаем массив результата умножения
        return result;
    }

    // Метод для преобразования массива цифр в строку
    static string ConvertToString(int[] number)
    {
        // Создаем пустую строку
        string result = "";

        // Проходимся по каждой цифре в массиве
        foreach (int digit in number)
        {
            // Преобразуем цифру в строку и добавляем к результату
            result += digit.ToString();
        }

        // Удаляем ведущие нули и возвращаем строку
        return result.TrimStart('0');
    }
}
```
Главной идеей задачи было не использовать сами числа, а работать исключительно со строками.

Такие задачки принадлежат к длинной арифметике.

Возьмем за пример числа:

12345 та 56789

На первом этапе там нужно перемножить каждую цифру первого числа на каждую цифру другого входящего числа, в результате у нас выйдет несколько новых значений.



На следующем этапе по правилам умножения в столбик нужно добавить ранее найденные значения начиная с последнего к первому со смещением на 1 в левую сторону при каждой итерации.


Для ускорения выполнения задачи следует выполнять последний шаг на каждом этапе умножения первого числа на некоторую цифру другого, в этом случае не нужно будет запоминать все полученные значения, а достаточно будет иметь текущий результат умножения на цифру и промежуточный общий результат.